---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.EngagementBiggerThanLengthError
source: html/2083e5fa-8920-6e91-e9d9-30973b12d409.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.EngagementBiggerThanLengthError Property

This is used to post error. The sum of bar engagements is greater than the total coupler length.

## Syntax (C#)
```csharp
public static FailureDefinitionId EngagementBiggerThanLengthError { get; }
```